app/views/students/show.html.erb


  <% @student.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" INNER JOIN "registrations" ON "sections"."id" = "registrations"."section_id" WHERE "registrations"."student_id" = 193