app/views/sections/index.html.erb

    <td><%= rank_range(section) %></td>
    <td><%= section.students.size %> </td>
---
SELECT COUNT(*) FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."section_id" = 3