app/views/sections/show.html.erb

SELECT "students".* FROM "students" INNER JOIN "registrations" ON "students"."id" = "registrations"."student_id" WHERE "registrations"."section_id" = 3
---

    <% @section.students.each do |student| %>