app/controllers/events_controller.rb

INSERT INTO "events" ("active", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["active", true], ["created_at", Thu, 21 Mar 2013 00:36:00 EDT -04:00], ["name", "testEvent"], ["updated_at", Thu, 21 Mar 2013 00:36:00 EDT -04:00]]
---
  def create
    @event = Event.new(params[:event])

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "events" SET "name" = 'Breaking Boards', "updated_at" = '2013-03-21 04:43:23.347080' WHERE "events"."id" = 3
---
  def update
    @event = Event.find(params[:id])

    if @event.update_attributes(params[:event])