app/controllers/registrations_controller.rb

  def index
  	@registrations = Registration.by_student.paginate(:page => params[:page]).per_page(10)
---
SELECT "registrations".* FROM "registrations" ORDER BY date LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "registrations"

  def show
  	@registration = Registration.find(params[:id])
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "44"]]