app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "9"]]
---
  def show
  	@section = Section.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "6"]]
---
  def edit
	@section = Section.find(params[:id])

INSERT INTO "sections" ("active", "created_at", "event_id", "max_age", "max_rank", "min_age", "min_rank", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @section = Section.new(params[:section])

    if @section.save

SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", "12"]]
---
  def update
    @section = Section.find(params[:id])