app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE (students.active = 't') AND (students.active = 'f') ORDER BY last_name, first_name LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "students" WHERE (students.active = 't')
---
  def index
  	@students = Student.alphabetical.paginate(:page => params[:page]).per_page(10)

INSERT INTO "students" ("active", "created_at", "date_of_birth", "first_name", "last_name", "phone", "rank", "updated_at", "waiver_signed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = Student.new(params[:student])

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "359"]]
UPDATE "students" SET "rank" = 14, "updated_at" = '2013-03-25 14:49:23.610675' WHERE "students"."id" = 359
---
  def update
    @student = Student.find(params[:id])

    if @student.update_attributes(params[:student])